<a href="https://colab.research.google.com/github/sanu1230/iNeuron_Project/blob/main/Making_Dataset_for_Business_(short_term)_loan_Banking_Project.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Creating Dummy Dataset of bank for Personal Loan product

## Attributes:

- Date_of_dis => Date of loan disbursement
- Customer_id
- First_name
- Last_name
- Gender => (Male, Female)
- Email
- Phone
- Age
- Occupation => Customers occupation
- Income
- Marital_status => (Married, Single, Divorced, Widowed, Seperated)
- Principle_Amount
- Interest_rate
- Processing_fee
- Tenure => (12, 24, 36, 48, 60)months
- EMI
- First_duedate
- Tenure_rem => Tenure Remaining
- Principle_amt_rem => Principle amount remaining
- Last_duedate
- Next_duedate
- Loan_status => (Active, Collection, Sold, Paidoff)
- Loan_purpose => ('Bill Payments', 'Emergency Expenses', 'Home Repairs', 'Refinance', 'Medical Expense', 'Personal Expenses')

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
# Creating date in 1lac rows

date_range = pd.date_range(start='2018-01-01', end= '2019-12-31', freq='D')
date = list(pd.Series(date_range))
Date_of_dis = np.random.choice(date, 100000)
df = pd.DataFrame(Date_of_dis, columns=['Date_of_dis'])
df['Date_of_dis'] = sorted(df['Date_of_dis'])
df.head()

  Date_of_dis
0  2018-01-01
1  2018-01-01
2  2018-01-01
3  2018-01-01
4  2018-01-01

In [ ]:
df.shape

(100000, 1)

In [ ]:
# Creating Customer Id data
import random

df['Customer_id'] = sorted(random.sample(range(1000000, 9999999), len(df['Date_of_dis']))) 
df.head()

  Date_of_dis  Customer_id
0  2018-01-01      1000017
1  2018-01-01      1000229
2  2018-01-01      1000363
3  2018-01-01      1000403
4  2018-01-01      1000908

In [ ]:
# Creating 1 lac names (50k male & 50k female names)

malename = pd.read_csv('/content/Indian-Male-Names.csv')
malename = malename.drop(['gender', 'race'], axis=1)

femalename = pd.read_csv('/content/Indian-Female-Names.csv')
femalename = femalename.drop(['gender', 'race'], axis=1)

In [ ]:
# removing all missing data and non alpha data
malefirstname=[]

for x in malename['name']:
  if type(x) == str:
    malefirstname.append(x)
# -------------------------------------
femalefirstname=[]

for x in femalename['name']:
  if type(x) == str:
    femalefirstname.append(x)

In [ ]:
# taking only the first word of the name
male_first_name = []

for x in malefirstname:
  male_first_name.append(x.split()[0])

#------------------------------

female_first_name = []

for x in femalefirstname:
  female_first_name.append(x.split()[0])

In [ ]:
print(len(male_first_name))
print(len(female_first_name))

14821
15351

In [ ]:
lastname = pd.read_csv('/content/Indian-Last-Names.csv')


# removing all missing data and non alpha data
l_name=[]

for x in lastname['Last_names']:
  if type(x) == str:
    l_name.append(x)

# taking only the first word of the name
last_name = []

for x in l_name:
  last_name.append(x.split()[0])

In [ ]:
first_name = male_first_name + female_first_name
len(first_name)

30172

In [ ]:
len(last_name)

564

In [ ]:
df['First_name'] = np.random.choice(first_name, 100000)
df['Last_name'] = np.random.choice(last_name, 100000)

In [ ]:
df['First_name'] = df.First_name.str.capitalize()
df['Last_name'] = df.Last_name.str.capitalize()
df.head()

  Date_of_dis  Customer_id First_name     Last_name
0  2018-01-01      1000017      Pooja     Mukherjee
1  2018-01-01      1000229      Manoj  Mukhopadhyay
2  2018-01-01      1000363     Shanti         Lalla
3  2018-01-01      1000403       Amit          Kaul
4  2018-01-01      1000908       Smt.        Sehgal

In [ ]:
# Creating gender

gender = ['Male', 'Female']

df['Gender'] = np.random.choice(gender, 100000)

In [ ]:
# Creating Email

df['Email'] = df.First_name.str.lower() + '.' + df.Last_name.str.lower() + '@dummyemail.com'

In [ ]:
# Creating Phone #

df['Phone'] = random.sample(range(7000000000, 9999999999), 100000)

In [ ]:
# Creating Age

df['Age'] = np.random.choice(range(25, 55), 100000)

In [ ]:
# Creating Occupation

occupation = ['Engineer', 'Teacher', 'Architect', 'Consultant', 'Scientist', 'Software Developer',
              'Lawyer', 'Psychologist', 'Veterinarian', 'Civil Engineer', 'Surveyor', 'Secretary',
              'Broker', 'Train_driver', 'Physician', 'Furniture Designer', 'Aviator', 'Estate agent',
              'Domestic worker', 'Chef', 'Hotel Manager', 'Financial Analyst', 'Political scientist',
              'Author', 'Biomedical Engineer', 'Official', 'Mathematician', 'Loan Officer', 'Machinist',
              'Musician', 'Businessperson', 'Civil servant', 'Tailor', 'Politician', 'Designer', 'Industrial Engineer',
              'Physiotherapist', 'Drafter', 'Rocket scientist', 'Graphic Designer', 'Health professional',
              'Petroleum Engineer', 'Flight attendant', 'Historian', 'Mechanical engineer', 'Flight engineer',
              'Professor', 'Army officer', 'Makeup Artist', 'School counselor', 'Computer operator', 'Govt.Service',
              'Service', 'Self Employed']

df['Occupation'] = np.random.choice(occupation, 100000)

In [ ]:
# Creating income column
df['Income'] = np.random.randint(300000, 3000000, 100000)

In [ ]:
# Creating maritak status

marital_status = ['Married', 'Divorced', 'Single', 'Widowed', 'Separated']

df['Marital_status'] = np.random.choice(marital_status, 100000, p=[0.6, 0.1, 0.1, 0.1, 0.1])

In [ ]:
# Creating Principle Amount

df['Principle_Amount'] = np.random.randint(300, 3000, 100000)
df['Principle_Amount'] = df['Principle_Amount']*1000

In [ ]:
# Creating Interest rate

df['Interest_rate'] = np.random.uniform(14, 24, 100000)
df['Interest_rate'] = df['Interest_rate'].round(2)

In [ ]:
# Processing fee is 0.35% of the principle amount

df['Processing_fee'] = df['Principle_Amount']*0.35/100

In [ ]:
# Tenure
tenure = [12, 24, 36, 48, 60]
df['Tenure'] = np.random.choice(tenure, 100000)

In [ ]:
# Creating EMI based on principle amount, interest rate & tenure

df['EMI'] = ((df['Tenure']/12)*(df['Interest_rate'])+df['Principle_Amount'])/df['Tenure']
df['EMI'] = df['EMI'].round(2)

In [ ]:
# creating due date

date = [2, 10, 17, 24]
dates = np.random.choice(date, 100000)
year = []
month= []

for x in df['Date_of_dis']:
  y = x.year
  year.append(y)
  m = x.month
  month.append(m)

duedate = pd.DataFrame(list(zip(year, month, dates)), columns=['year', 'month', 'day'])

df['First_duedate'] = pd.to_datetime(duedate[['year', 'month', 'day']])

In [ ]:
for index, row in df.iterrows():
  if row['Tenure'] == 12 and row['First_duedate'].year == 2018:
    y = str(random.choices(range(12), weights=range(13, 1, -1))).strip('[]')
    
print(y)

4

In [ ]:
# Tenure remaining
import random

tenure_rem = []
for index, row in df.iterrows():
  if row['Tenure'] == 12 and row['First_duedate'].year == 2018:
    y = str(random.choices(np.arange(0, 12), weights=range(12, 0, -1))).strip('[]')
    tenure_rem.append(y)
  elif row['Tenure'] == 12 and row['First_duedate'].year == 2019:
    y = str(random.choices(np.arange(0, 12), weights=range(12, 0, -1))).strip('[]')
    tenure_rem.append(y)
  elif row['Tenure'] == 24 and row['First_duedate'].year == 2018:
    y = str(random.choices(np.arange(0, 24), weights=range(24, 0, -1))).strip('[]')
    tenure_rem.append(y)
  elif row['Tenure'] == 24 and row['First_duedate'].year == 2019:
    y = str(random.choices(np.arange(0, 24), weights=range(24, 0, -1))).strip('[]')
    tenure_rem.append(y)
  elif row['Tenure'] == 36 and row['First_duedate'].year == 2018:
    y = str(random.choices(np.arange(0, 36), weights=range(36, 0, -1))).strip('[]')
    tenure_rem.append(y)
  elif row['Tenure'] == 36 and row['First_duedate'].year == 2019:
    y = str(random.choices(np.arange(0, 36), weights=range(36, 0, -1))).strip('[]')
    tenure_rem.append(y)
  elif row['Tenure'] == 48 and row['First_duedate'].year == 2018:
    y = str(random.choices(np.arange(0, 48), weights=range(48, 0, -1))).strip('[]')
    tenure_rem.append(y)
  elif row['Tenure'] == 48 and row['First_duedate'].year == 2019:
    y = str(random.choices(np.arange(0, 48), weights=range(48, 0, -1))).strip('[]')
    tenure_rem.append(y)
  elif row['Tenure'] == 60 and row['First_duedate'].year == 2018:
    y = str(random.choices(np.arange(0, 60), weights=range(60, 0, -1))).strip('[]')
    tenure_rem.append(y)
  elif row['Tenure'] == 60 and row['First_duedate'].year == 2019:
    y = str(random.choices(np.arange(0, 60), weights=range(60, 0, -1))).strip('[]')
    tenure_rem.append(y)

df['Tenure_rem'] = tenure_rem
df['Tenure_rem'] = df['Tenure_rem'].astype('int')

In [ ]:
# Principle amount remaining

df['Principle_amt_rem'] = df['Principle_Amount'] - (((df['Tenure'] - df['Tenure_rem'])*df['EMI'])*60/100)
df['Principle_amt_rem'] =df['Principle_amt_rem'].round(2)

In [ ]:
# Finding last Due date
from datetime import date
from dateutil.relativedelta import relativedelta

last_duedate = []
for index, row in df.iterrows():
  ld = row['First_duedate'] + relativedelta(months=+row['Tenure'])
  last_duedate.append(ld)

df['Last_duedate'] = last_duedate

In [ ]:
# Next Duedate
from datetime import datetime

next_duedate = []

for index, row in df.iterrows():
  nd = row['First_duedate'] + relativedelta(months=+(row['Tenure'] - row['Tenure_rem']))
  next_duedate.append(nd)

df['Next_duedate'] = next_duedate

In [ ]:
# Loan Status
from datetime import datetime

loanstatus = []

for index, row in df.iterrows():
  if row['Next_duedate'] >= datetime.now() and row['Next_duedate'] <= row['Last_duedate']:
    loanstatus.append('Active')
  elif row['Next_duedate'] < datetime.now() and row['Next_duedate'] < row['Last_duedate']:
    if row['Next_duedate'] >= (datetime.now() - relativedelta(months=+3)) and row['Next_duedate'] < datetime.now():
      loanstatus.append('Collection')
    elif row['Next_duedate'] < (datetime.now() - relativedelta(months=+3)) and row['Next_duedate'] < datetime.now():
      loanstatus.append('Sold')
  elif row['Next_duedate'] <= datetime.now() and row['Next_duedate'] >= row['Last_duedate']:
    loanstatus.append('Paidoff')
  

df['Loan_status'] = loanstatus

In [ ]:
df.Loan_status.value_counts()

Active        52048
Sold          37964
Collection     6515
Paidoff        3473
Name: Loan_status, dtype: int64

In [ ]:
# Loan Purpose 

purpose = ['Bill Payments', 'Emergency Expenses', 'Home Repairs', 'Refinance', 'Medical Expense', 'Personal Expenses']

df['Loan_purpose'] = np.random.choice(purpose, 100000)

In [ ]:
df.head()

  Date_of_dis  Customer_id  ... Loan_status       Loan_purpose
0  2018-01-01      1000017  ...      Active       Home Repairs
1  2018-01-01      1000229  ...      Active  Personal Expenses
2  2018-01-01      1000363  ...      Active    Medical Expense
3  2018-01-01      1000403  ...        Sold  Personal Expenses
4  2018-01-01      1000908  ...        Sold          Refinance

[5 rows x 23 columns]

In [ ]:
df.columns

Index(['Date_of_dis', 'Customer_id', 'First_name', 'Last_name', 'Gender',
       'Email', 'Phone', 'Age', 'Occupation', 'Income', 'Marital_status',
       'Principle_Amount', 'Interest_rate', 'Processing_fee', 'Tenure', 'EMI',
       'First_duedate', 'Tenure_rem', 'Principle_amt_rem', 'Last_duedate',
       'Next_duedate', 'Loan_status', 'Loan_purpose'],
      dtype='object')

In [ ]:
df.to_csv('Personal_loan_dataset.csv')